examples/family/FamilyContext.puml
@startuml
package FamilyContext {
Note top of Family
In most societies, the family is the principal institution for the socialization of children.
End note
  class Family {
    name:Text
    weddingDate:Date
    weddingPlace:Text
    yearMarried:Number
    monthMarried:Number
    divorced:Date
    husbandOf:Page
    wifeOf:Page
  }
Note top of Person
A Person is a human being
End note
  class Person {
    qid:Text
    royal92id:Text
    name:Text
    nobleTitle:Text
    picture:URL
    sex:Text
    born:Date
    yearBorn:Number
    monthBorn:Number
    birthPlace:Text
    died:Date
    diedAt:Text
    yearDied:Number
    monthDied:Number
    noInLine:Number
    wikiPedia:URL
  }
}
Family "childOf 1" -- "children *" Person
Family "parentOf 1" -- "parents *" Person
Person "spouse 1" -- "spouses *" Person

' BITPlan Corporate identity skin params
' Copyright (c) 2015-2023 BITPlan GmbH
' see http://wiki.bitplan.com/PlantUmlSkinParams#BITPlanCI
' skinparams generated by com.bitplan.restmodelmanager
skinparam note {
  BackGroundColor #FFFFFF
  FontSize 12
  ArrowColor #FF8000
  BorderColor #FF8000
  FontColor black
  FontName Technical
}
skinparam component {
  BackGroundColor #FFFFFF
  FontSize 12
  ArrowColor #FF8000
  BorderColor #FF8000
  FontColor black
  FontName Technical
}
skinparam package {
  BackGroundColor #FFFFFF
  FontSize 12
  ArrowColor #FF8000
  BorderColor #FF8000
  FontColor black
  FontName Technical
}
skinparam usecase {
  BackGroundColor #FFFFFF
  FontSize 12
  ArrowColor #FF8000
  BorderColor #FF8000
  FontColor black
  FontName Technical
}
skinparam activity {
  BackGroundColor #FFFFFF
  FontSize 12
  ArrowColor #FF8000
  BorderColor #FF8000
  FontColor black
  FontName Technical
}
skinparam classAttribute {
  BackGroundColor #FFFFFF
  FontSize 12
  ArrowColor #FF8000
  BorderColor #FF8000
  FontColor black
  FontName Technical
}
skinparam interface {
  BackGroundColor #FFFFFF
  FontSize 12
  ArrowColor #FF8000
  BorderColor #FF8000
  FontColor black
  FontName Technical
}
skinparam class {
  BackGroundColor #FFFFFF
  FontSize 12
  ArrowColor #FF8000
  BorderColor #FF8000
  FontColor black
  FontName Technical
}
skinparam object {
  BackGroundColor #FFFFFF
  FontSize 12
  ArrowColor #FF8000
  BorderColor #FF8000
  FontColor black
  FontName Technical
}
hide Circle
' end of skinparams '
@enduml
